АлогистикТест2/src/Documents/алк_РезервизрованиеЗапасов/алк_РезервизрованиеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>алк_РезервизрованиеЗапасов</name>
  <registerRecords>InformationRegister.алк_ПакетыИсторияЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияНоменклатуры</name>
    <type>
      <types>CatalogRef.КатегорииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресХранилищаОтборов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерийныйНомер</name>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПакетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

АлогистикТест2/src/AccumulationRegisters/алк_ЗапасыНаСкладахСерии/алк_ЗапасыНаСкладахСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>алк_ЗапасыНаСкладахСерии</name>
  <resources>
    <name>КоличествоПакетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>EnumRef.алк_ВидыОперацийПеремещениеЗапасов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Смена</name>
    <type>
      <types>CatalogRef.алк_Смены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаСмены</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Штабель</name>
    <type>
      <types>CatalogRef.алк_Штабели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СменаУдалить</name>
    <type>
      <types>EnumRef.Смены</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыПакетов/алк_ПараметрыПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыПакетов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НомерПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодПакета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСостав</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>СертификатFSC</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбъемТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесНеттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВесБруттоТаможня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПериодУпаковки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>БоковаяДоска</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.СертификатыНаПродукцию</types>
    </type>
  </resources>
  <resources>
    <name>Габарит</name>
    <type>
      <types>EnumRef.алк_ГабаритПакета</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияНоменклатурыПЭО</name>
    <type>
      <types>CatalogRef.алк_КатегорияНоменклатурыПЭО</types>
    </type>
  </resources>
  <resources>
    <name>Сухой</name>
    <comment>Для пакетов СП</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Припуск</name>
    <type>
      <types>CatalogRef.алк_ВариантыПрипуска</types>
    </type>
  </resources>
  <resources>
    <name>ПризнакНЗП</name>
    <type>
      <types>EnumRef.алк_ПризнакНЗП</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПараметрыХарактеристик/алк_ПараметрыХарактеристик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПараметрыХарактеристик</name>
  <resources>
    <name>Порода</name>
    <type>
      <types>CatalogRef.Породы</types>
    </type>
  </resources>
  <resources>
    <name>Сорт</name>
    <type>
      <types>CatalogRef.Сорта</types>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>CatalogRef.Длины</types>
    </type>
  </resources>
  <resources>
    <name>Сечение</name>
    <type>
      <types>CatalogRef.РазмерСечения</types>
    </type>
  </resources>
  <resources>
    <name>Поверхность</name>
    <type>
      <types>CatalogRef.Поверхности</types>
    </type>
  </resources>
  <resources>
    <name>Влажность</name>
    <type>
      <types>CatalogRef.Влажность</types>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <comment>Расчетный объем одной штуки исходя из размера. Заполняется при записи набора</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>10</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоличествоРеквизитов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/InformationRegisters/алк_ПакетыИсторияЗаказов/алк_ПакетыИсторияЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>алк_ПакетыИсторияЗаказов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.алк_ЗаказПокупателя</types>
    </type>
  </resources>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

АлогистикТест2/src/Documents/алк_РезервизрованиеЗапасов/Forms/ФормаДокумента/Module.bsl
#Область СобытияФормы




#КонецОбласти 

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ВложенныйЗапрос.СерийныйНомер,
	|	ВложенныйЗапрос.КоличествоПакетов
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	(ВЫБРАТЬ
	|		алк_ЗапасыНаСкладахСерииОстатки.Номенклатура КАК Номенклатура,
	|		алк_ЗапасыНаСкладахСерииОстатки.СерийныйНомер КАК СерийныйНомер,
	|		алк_ЗапасыНаСкладахСерииОстатки.КоличествоПакетовОстаток КАК КоличествоПакетов
	|	ИЗ
	|		РегистрНакопления.алк_ЗапасыНаСкладахСерии.Остатки(
	|				,
	|				Организация = &Организация
	|					И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|					И Номенклатура = &Номенклатура) КАК алк_ЗапасыНаСкладахСерииОстатки) КАК ВложенныйЗапрос
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура,
	|	ВТ.СерийныйНомер,
	|	ВТ.КоличествоПакетов,
	|	алк_ПараметрыПакетовСрезПоследних.Характеристика,
	|	ЕСТЬNULL(алк_ПакетыИсторияЗаказовСрезПоследних.ЗаказПокупателя, ЗНАЧЕНИЕ(Документ.алк_ЗаказПокупателя.ПустаяСсылка)) КАК ЗаказПокупателя,
	|	алк_ПараметрыПакетовСрезПоследних.Объем
	|ПОМЕСТИТЬ втРезультатПоПараметрам
	|ИЗ
	|	ВТ КАК ВТ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыПакетов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ.СерийныйНомер
	|					ИЗ
	|						ВТ КАК ВТ)) КАК алк_ПараметрыПакетовСрезПоследних
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПараметрыХарактеристик КАК алк_ПараметрыХарактеристик
	|			ПО (алк_ПараметрыХарактеристик.Характеристика = алк_ПараметрыПакетовСрезПоследних.Характеристика)
	|		ПО ВТ.СерийныйНомер = алк_ПараметрыПакетовСрезПоследних.СерийныйНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.алк_ПакетыИсторияЗаказов.СрезПоследних(
	|				,
	|				СерийныйНомер В
	|					(ВЫБРАТЬ
	|						ВТ.СерийныйНомер
	|					ИЗ
	|						ВТ КАК ВТ)) КАК алк_ПакетыИсторияЗаказовСрезПоследних
	|		ПО ВТ.СерийныйНомер = алк_ПакетыИсторияЗаказовСрезПоследних.СерийныйНомер
	|ГДЕ
	|	(алк_ПараметрыПакетовСрезПоследних.Характеристика = &Характеристика
	|			ИЛИ &ВсеХарактеристика)
	|	И (алк_ПараметрыХарактеристик.Длина = &Длина
	|			ИЛИ &ВсеДлина)
	|	И (алк_ПараметрыХарактеристик.Порода = &Порода
	|			ИЛИ &ВсеПорода)
	|	И (алк_ПараметрыХарактеристик.Сорт В (&Сорт)
	|			ИЛИ &ВсеСорт)
	|	И (алк_ПараметрыХарактеристик.Сечение В (&Сечение)
	|			ИЛИ &ВсеСечение)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втРезультатПоПараметрам.Номенклатура,
	|	втРезультатПоПараметрам.СерийныйНомер,
	|	втРезультатПоПараметрам.КоличествоПакетов,
	|	втРезультатПоПараметрам.Характеристика,
	|	втРезультатПоПараметрам.ЗаказПокупателя,
	|	втРезультатПоПараметрам.Объем
	|ИЗ
	|	втРезультатПоПараметрам КАК втРезультатПоПараметрам
	|ГДЕ
	|	втРезультатПоПараметрам.ЗаказПокупателя = &ЗаказПокупателя";
	
	Запрос.УстановитьПараметр("Номенклатура", ОтборНоменклатура);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	Запрос.УстановитьПараметр("ВсеХарактеристика", ?(ЗначениеЗаполнено(ОтборХарактеристика), Ложь, Истина));
	Запрос.УстановитьПараметр("Характеристика", ОтборХарактеристика);
	Запрос.УстановитьПараметр("ВсеДлина", ?(ЗначениеЗаполнено(ОтборДлина), Ложь, Истина));
	Запрос.УстановитьПараметр("Длина", ОтборДлина);
	Запрос.УстановитьПараметр("ВсеПорода", ?(ЗначениеЗаполнено(ОтборПорода), Ложь, Истина));
	Запрос.УстановитьПараметр("Порода", ОтборПорода);
	Запрос.УстановитьПараметр("ВсеСорт", ?(ЗначениеЗаполнено(ОтборСорт), Ложь, Истина));
	Запрос.УстановитьПараметр("Сорт", ОтборСорт);
	Запрос.УстановитьПараметр("ВсеСечение", ?(ЗначениеЗаполнено(ОтборСечение), Ложь, Истина));
	Запрос.УстановитьПараметр("Сечение", ОтборСечение);
	
	Запрос.УстановитьПараметр("ЗаказПокупателя", ?(ОтборБезЗаказа, Документы.алк_ЗаказПокупателя.ПустаяСсылка(), ОтборЗаказПокупателя));
	
	РезультатЗапроса = Запрос.Выполнить();   //  РезультатЗапроса.Выгрузить()
	
	Объект.Запасы.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	ЗаполнитьПоОстаткамНаСервере();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтборСортНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Номенклатура", ОтборНоменклатура); 
	ПараметрыФормы.Вставить("СтрокаКоманды", "Справочник.Сорта.ФормаВыбора");
	Форма = ОткрытьФорму("Обработка.алк_ПодборВСписки.Форма.ФормаПодборИзПодчинСпр", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСечениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("Номенклатура", ОтборНоменклатура); 
	ПараметрыФормы.Вставить("СтрокаКоманды", "Справочник.РазмерСечения.ФормаВыбора");
	Форма = ОткрытьФорму("Обработка.алк_ПодборВСписки.Форма.ФормаПодборИзПодчинСпр", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыСерийныйНомерПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные;
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.СерийныйНомер) Тогда
		Возврат;
	Иначе
				
		ПараметрыПакета = РфпПолучениеДанныхСервер.ПараметрыПакетаНоменклатурыПоСерийныйНомер(СтрокаТабличнойЧасти.СерийныйНомер);
		
		СтрокаТабличнойЧасти.Характеристика 	= ПараметрыПакета.Характеристика;
		СтрокаТабличнойЧасти.КоличествоПакетов 	= 1;
		СтрокаТабличнойЧасти.Объем 				= ПараметрыПакета.Объем;
		
		СтрокаТабличнойЧасти.ТекущийЗаказ =  ПолучитьТекущийЗаказ(СтрокаТабличнойЧасти.СерийныйНомер, Объект.Дата);
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийЗаказ(СерийныйНомер, ДатаСреза)

	ТекущийЗаказ = Документы.алк_ЗаказПокупателя.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	алк_ПакетыИсторияЗаказовСрезПоследних.ЗаказПокупателя
		|ИЗ
		|	РегистрСведений.алк_ПакетыИсторияЗаказов.СрезПоследних(&ДатаСреза, СерийныйНомер = &СерийныйНомер) КАК алк_ПакетыИсторияЗаказовСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаСреза", 		ДатаСреза); 
	Запрос.УстановитьПараметр("СерийныйНомер", 	СерийныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущийЗаказ = ВыборкаДетальныеЗаписи.ЗаказПокупателя;
	КонецЦикла;
	
	Возврат ТекущийЗаказ;


КонецФункции // ПолучитьТекущийЗаказ()

&НаСервере
Процедура ОбновитьТекущийЗаказ()
	
	Для каждого Стр Из Объект.Запасы Цикл                                                             		
		Стр.ТекущийЗаказ = ПолучитьТекущийЗаказ(Стр.СерийныйНомер, Объект.Дата);	
	КонецЦикла;
	
КонецПроцедуры
 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьТекущийЗаказ();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьТекущийЗаказ();	
	
КонецПроцедуры
